////每日一题6-10
////1.另类加法
////1. 二进制位异或运算相当于对应位相加，不考虑进位
////比如： 1 ^ 1 = 0 ---> 1 + 1 = 0 (当前位值为0，进一位)
////1 ^ 0 = 1 ---> 1 + 0 = 1 (当前位值为1)
////0 ^ 0 = 0 ---> 0 + 0 = 0 (当前位值为0)
////2. 二进制位与运算相当于对应位相加之后的进位
////1 & 0 = 0 ---> 1 + 0 = 1 (当前位的值不进位)
////0 & 0 = 0 ---> 0 + 0 = 0 (当前位的值不进位)
////3. 两个数相加：对应二进制位相加的结果 + 进位的结果
////比如：3 + 2 --> 0011 + 0010 --> 0011 ^ 0010 + ((0011 & 0010) << 1)
////---> (0011 ^ 0010) ^ ((0011 & 0010) << 1)， 当进位之后的结果为0时，相加结束
//
//class UnusualAdd
//{
//public:
//	int AddAB(int A, int B)
//	{
//		int sum = 0, carry = 0;
//		while (B != 0)
//		{
//			//对应位的和
//			sum = A^B;
//			//对应位和的进位，既然是进位，就要整体左移一位
//			carry = (A&B) << 1;
//			A = sum;
//			B = carry;
//		}
//		return sum;
//	}
//};

//2.求路径总数
#include<iostream>
using namespace std;
int pathNum(int n, int m)
{
	if (n > 1 && m > 1)
		//b情况，递归
		return pathNum(n - 1, m) + pathNum(n, m - 1);
	else if (((n >= 1) && (m == 1)) || ((n == 1) && (m >= 1)))
		// a情况，终止条件
		return n + m;
	else
		//格子为0时， 路径为0
		return 0;
} 
int main()
{
	int n, m;
	while (cin >> n >> m)
	{
		cout << pathNum(n, m) << endl;
	} 
	return 0;
}
